[
  {
    "category": "coursework",
    "subcategory": "EAS 531",
    "title": "Vector Spatial Overlay Analysis",
    "description": "Real-world GIS application displaying multiple types of spatial information in a digestible format for general audiences.",
    "image": "assets/images/TRI-layout.jpg",
    "fullDescription": "Completed as part of Environ 531: GIS Principles. This course emphasized real-world applications of GIS, and the goal of this assignment was to display multiple types of spatial information in a way which is still digestible to a general audience."
  },
  {
    "category": "coursework",
    "subcategory": "Environ 309",
    "title": "Earthquake Risk Assessment, part 2",
    "description": "Final project for Environ 309: Combines geologic and demographic factors to identify at-risk areas.",
    "image":"assets/images/Overlay-Layout.jpg",
    "fullDescription": "This analysis combines geologic and demographic factors using raster calculations and spatial overlay tools to identify high-risk areas and vulnerable populations."
  },
  {
    "category": "coursework",
    "subcategory": "Environ 309",
    "title": "Earthquake Risk Assessment, part 1",
    "description": "Comprehensive semester project assessing earthquake and liquefaction risk along the San Andreas fault.",
    "image": "assets/images/Liquefaction-Risk-Layout.jpg",
    "fullDescription": "This analysis used raster calculations to combine geologic factors like soil porosity and water availability, then reclassed the values to ranked scores."
  },
  {
    "category": "coursework",
    "subcategory": "Environ 309",
    "title": "Vector Suitability Analysis",
    "description": "Spatial analysis and cartographic visualization of hypothetical risk surrounding Fermi 2 Nuclear Generating Station.",
    "image": "assets/images/FermiLayout.jpg",
    "fullDescription": "This assignment used stacked data queries to identify regions of interest, as well as spatial overlay tools to combine the various data sources. I also utilized Esri data enrichment to calculate spatial statistics for the region."
  },
  {
    "category": "coursework",
    "subcategory": "Earth 408",
    "title": "Raster Suitability Analysis",
    "description": "Employed ArcGIS Model Builder and Python scripting to combine multiple raster datasets.",
    "image": "assets/images/suitability_analysis.jpg",
    "fullDescription": "Completed for Earth 408. In this assignment I employed ArcGIS Model Builder and Python script to analyze and edit multiple raster datasets at once using various raster calculations, ultimately outputting a dataset that displayed areas with the correct limiting criteria.."
  },
  {
    "category": "coursework",
    "subcategory": "Earth 408",
    "title": "Watershed Boundary Delineation",
    "description": "Here I used a digital elevation model to calculate the watershed boundary, flow direction, and stream order of the study area, using ArcGIS Hydrologic Modeling tools.",
    "image": "assets/images/watershed.jpg",
    "fullDescription": 
  },
  {
    "category": "coursework",
    "subcategory": "Earth 408",
    "title": "3D Terrain and Cost Path Analysis",
    "description": "In this project I calculated optimal paths over digital elevation models showing how terrain affects pathfinding cost.",
    "image": "assets/images/cost_path.jpg",
    "fullDescription": "This project shows the local 3D scene of a shaded relief of terrain. I calculated distance over a digital elevation model, and learned how the “cost” of a path is calculated and changed given different input parameters."
  },
  {
    "category": "coursework",
    "subcategory": "Earth 408",
    "title": "Harmful Algal Bloom Formation Study",
    "description": "Final project conducting comprehensive watershed analysis to study HAB formation in local lakes.",
    "image": "svg",
    "fullDescription": "This research project combines hydrologic modeling, water quality analysis, and spatial statistics to understand the environmental factors contributing to harmful algal bloom formation. Research presented in poster format.",
    "pdfLink": "assets/final_proj/final.pdf"
  },
  {
    "category": "personal",
    "subcategory": "QGIS",
    "title": "Lake Michigan Bathymetry Visualization",
    "description": "Exploring bathymetry data visualization by testing color palettes and cartographic styles.",
    "image": "assets/images/lake_michigan.png",
    "fullDescription": 
  {
    "category": "personal",
    "subcategory": "QGIS",
    "title": "Lake Superior Bathymetry Visualization",
    "description": "I continue the bathymetry series with Lake Superior, showcasing different color palettes and design",
    "image": "assets/images/lake_superior.jpg",
    "fullDescription":  
  {
    "category": "personal",
    "subcategory": "QGIS",
    "title": "Mumbai Elevation Visualization",
    "description": "Stylisticly displaying the area's elevation.",
    "image": "assets/images/mumbai.jpg",
    "fullDescription": 
  },
  {
    "category": "personal",
    "subcategory": "QGIS",
    "title": "UMS Ticket Office Venues Map",
    "description": "This map shows the venues of my undergraduate job at the UMS Ticket Office, which I created to show how GIS can be applied beyond strictly scientific fields. Spatial data is all around us!",
    "image": "assets/images/ums.png",
    "fullDescription": 
  },
   {
    "category": "personal",
    "subcategory": "QGIS",
    "title": "Douglas Lake Bathymetry",
    "description": "Visualization of Duglas Lake's depth and features.",
    "image": "assets/images/douglaslake_newcolor.JPEG",
    "fullDescription": "This was created while I took field classes at University of Michigan Biological Station, continuiong my exploration of color ramps and shading to show depth.",
  },
   {
    "category": "personal",
    "subcategory": "ArcGIS Pro",
    "subcategory": "30 Day Map Challenge",
    "title": "Shipwreck Locations in Lake Superior",
    "description": "Day one of the 2025 30 Day Map Challenge: theme is Points.",
    "image": "assets/images/douglaslake_newcolor.JPEG",
    "fullDescription": "I was inspired by this being the 50th year since the SS Edmund Fitzgerald was lost. November is a particularly dangerous month for ships on the Great Lakes.",
  }
]
